[
    {
        "id": "1",
        "title": "Where does Kenya get its energy?",
        "text": "Kenya generates its energy from a mix of sources, including renewable and non-renewable sources. Some of these energy sources are used directly while most are transformed into fuels or electricity for final consumption.",
        "image_url": [
            "https://upload.wikimedia.org/wikipedia/commons/5/55/Electric_power_transmission_line_towards_the_south-east_in_the_Tsavo_East_National_Park%2C_Kenya_2.jpg"
        ],
        "null": null
    },
    {
        "id": "2",
        "title": "Energy Supply",
        "text": "Total Energy Supply (TES) is a comprehensive measure that accounts for all the energy produced domestically or imported into a country, minus what is exported or stored. It represents the total energy available to meet the demand of end users within the country. TES encompasses various forms of energy, including electricity, fossil fuels, renewable energy sources, and other forms of energy used for different purposes such as transportation, industry, residential, and commercial sectors.",
        "image_url": null,
        "null": null
    },
    {
        "id": 4,
        "title": "Energy Sources in Kenya",
        "text": "Kenya's energy mix includes a variety of sources such as hydroelectric, geothermal, wind, solar, and biomass. These renewable sources play a significant role in the country's energy supply, contributing to its sustainability goals.",
        "images": [],
        "status": true
    },
    {
        "id": 5,
        "title": "Energy Supply Overview",
        "text": "Total energy supply (TES) in Kenya encompasses all energy produced or imported into the country, excluding exports or storage. It represents the energy required to meet the needs of end users, with various sources contributing to the overall supply.",
        "images": [],
        "status": true
    },
    {
        "id": 6,
        "title": "Energy Transformation and Consumption",
        "text": "Kenya's energy supply undergoes transformation processes where various sources are converted into fuels or electricity for consumption by end users. This transformation plays a crucial role in meeting the diverse energy needs of the country.",
        "images": [],
        "status": true
    },
    {
        "id": 7,
        "title": "Biofuels and Waste",
        "text": "Biofuels and waste represent the largest source of energy in Kenya, accounting for approximately 62% of the total energy supply. This includes renewable resources that are utilized efficiently to meet the country's energy demands.",
        "images": [],
        "status": true
    },
    {
        "id": 8,
        "title": "Renewable Energy Sources",
        "text": "Renewable energy sources such as wind, solar, and others contribute significantly to Kenya's energy mix, accounting for approximately 15% of the total energy supply. These sources play a vital role in the country's sustainability efforts.",
        "images": [],
        "status": true
    },
    {
        "id": 9,
        "title": "Non-Renewable Energy Sources",
        "text": "Non-renewable energy sources like oil, coal, and hydro contribute to Kenya's energy supply, with oil accounting for 18%, coal for 2.1%, and hydro for 1.1% of the total energy supply in 2021.",
        "images": [],
        "status": true
    },
    {
        "id": 10,
        "title": "Fossil Fuels and Renewable Energy",
        "text": "Domestic energy production in Kenya includes fossil fuels such as oil and coal, which are utilized for electricity generation and as fuels. Additionally, renewable energy sources like hydro, wind, and solar PV contribute significantly to domestic energy production.",
        "images": [],
        "status": true
    },
    {
        "id": 11,
        "title": "Bioenergy and Waste",
        "text": "Bioenergy, including modern and traditional sources, plays a crucial role in domestic energy production in Kenya. This includes the burning of municipal waste, showcasing the country's efforts towards sustainable energy practices.",
        "images": [],
        "status": true
    },
    {
        "id": 12,
        "title": "Nuclear Energy and Other Sources",
        "text": "While Kenya's domestic energy production primarily relies on fossil fuels and renewable sources, there is also a growing interest in exploring nuclear energy and other innovative sources to meet the country's energy needs.",
        "images": [],
        "status": true
    },
    {
        "id": 13,
        "title": "Evolution of Total Energy Supply in Kenya",
        "text": "The total energy supply in Kenya has evolved significantly since 2000, with contributions from various sources. This evolution includes increases in renewable energy sources like hydro, wind, solar, biofuels, and waste, alongside traditional sources like coal and oil.",
        "images": [
            "https://example.com/evolution_graph_kenya_energy_supply.svg",
            "https://example.com/evolution_graph_kenya_energy_supply.png",
            "https://example.com/evolution_graph_kenya_energy_supply.csv"
        ],
        "status": true
    },
    {
        "id": 14,
        "title": "Domestic Energy Production in Kenya",
        "text": "Kenya's domestic energy production encompasses a mix of fossil fuels, renewable sources like hydro, wind, solar, and biofuels/waste. This diverse production landscape reflects the country's efforts towards energy security and sustainability.",
        "images": [
            "https://example.com/domestic_production_kenya.svg",
            "https://example.com/domestic_production_kenya.png",
            "https://example.com/domestic_production_kenya.csv"
        ],
        "status": true
    },
    {
        "id": 14,
        "title": "Domestic Energy Production in Kenya",
        "text": "Kenya's domestic energy production encompasses a mix of fossil fuels, renewable sources like hydro, wind, solar, and biofuels/waste. This diverse production landscape reflects the country's efforts towards energy security and sustainability.",
        "images": [
            "https://example.com/domestic_production_kenya.svg",
            "https://example.com/domestic_production_kenya.png",
            "https://example.com/domestic_production_kenya.csv"
        ],
        "status": true
    },
    {
        "id": 16,
        "title": "Energy Transformation Overview",
        "text": "Energy transformation is a crucial process where various energy sources, especially fossil fuels, undergo conversion into more practical forms for use. This includes refining crude oil into different fuels and products, as well as utilizing coal, oil, and natural gas for electricity generation and heating purposes.",
        "images": [],
        "status": true
    },
    {
        "id": 17,
        "title": "Transformation of Fossil Fuels",
        "text": "Fossil fuels like crude oil, coal, and natural gas undergo significant transformation processes to extract useful energy forms. This includes refining crude oil into fuels and products, burning fossil fuels for electricity generation, and utilizing advanced technologies for efficient energy extraction.",
        "images": [],
        "status": true
    },
    {
        "id": 18,
        "title": "Minor Transformation Methods",
        "text": "While major energy transformation processes involve fossil fuels and electricity generation, minor methods such as extracting gas or oil from coal play relatively minor roles in most countries' energy systems. These methods are often specialized and limited in their application.",
        "images": [],
        "status": true
    },
    {
        "id": 19,
        "title": "Importance of Oil Refining",
        "text": "Oil refining is crucial for transforming crude oil into various oil products, including fuels for automobiles, ships, and planes. It plays a vital role in meeting energy demands and fueling transportation systems.",
        "images": [],
        "status": true
    },
    {
        "id": 20,
        "title": "Share of Domestic Refining",
        "text": "The share of domestic oil refining in consumption is -% of the total final consumption of oil products in Kenya in 2019. This indicates the importance of domestic refining capacity in meeting local energy needs.",
        "images": [],
        "status": true
    },
    {
        "id": 21,
        "title": "Total Oil Products Refined in Kenya",
        "text": "The total oil products refined in Kenya amounted to 25,447 TJ (terajoules) in 2013, reflecting the significant scale of oil refining activities in the country to meet energy demands.",
        "images": [],
        "status": true
    },
    {
        "id": 22,
        "title": "Oil Refining Trend",
        "text": "The trend in oil refining in Kenya shows a 70% change from 2000 to 2013, highlighting the evolution and growth of the oil refining sector over the years.",
        "images": [],
        "status": true
    },
    {
        "id": 23,
        "title": "Oil Refining Process",
        "text": "Oil refining involves complex processes such as distillation, cracking, and reforming to convert crude oil into valuable oil products like gasoline, diesel, and aviation fuel.",
        "images": [],
        "status": true
    },
    {
        "id": 24,
        "title": "Domestic Refining Capacity",
        "text": "Kenya's domestic refining capacity plays a critical role in reducing dependence on imported oil products, contributing to energy security and economic stability.",
        "images": [],
        "status": true
    },
    {
        "id": 25,
        "title": "Technological Advances in Refining",
        "text": "Advancements in oil refining technologies have improved efficiency and environmental sustainability, leading to cleaner and more refined oil products.",
        "images": [],
        "status": true
    },
    {
        "id": 26,
        "title": "Challenges in Oil Refining",
        "text": "Despite technological progress, challenges in oil refining include fluctuating oil prices, environmental concerns, and the need for continuous innovation to meet evolving energy demands.",
        "images": [],
        "status": true
    },
    {
        "id": 27,
        "title": "Future of Oil Refining",
        "text": "The future of oil refining involves a focus on renewable and alternative fuels, digitalization of refining processes, and sustainability practices to address environmental impacts.",
        "images": [],
        "status": true
    },
    {
        "id": 28,
        "title": "Global Oil Refining Industry",
        "text": "The global oil refining industry is dynamic, with trends such as consolidation, technological advancements, and diversification of products to meet changing market demands.",
        "images": [],
        "status": true
    },
    {
        "id": 29,
        "title": "Electricity Generation Overview",
        "text": "Electricity generation is a vital process that involves transforming energy into electrical power. This process is carried out through various methods, including thermal power plants and renewable energy sources.",
        "images": [],
        "status": true
    },
    {
        "id": 30,
        "title": "Thermal Power Plants",
        "text": "Thermal power plants generate electricity by harnessing the heat from burning fuels or nuclear reactions. Despite their efficiency, these plants can lose up to half of the energy content during generation.",
        "images": [],
        "status": true
    },
    {
        "id": 31,
        "title": "Renewable Power Sources",
        "text": "Renewable power sources generate electricity directly from natural forces such as the sun, wind, or water movement. These sources play a crucial role in sustainable electricity generation.",
        "images": [],
        "status": true
    },
    {
        "id": 32,
        "title": "Geothermal Power Generation",
        "text": "Geothermal power is a significant source of electricity generation in Kenya, accounting for 41% of the total generation in 2021. It harnesses heat from the Earth's interior to produce electricity.",
        "images": [],
        "status": true
    },
    {
        "id": 33,
        "title": "Hydroelectric Power Generation",
        "text": "Hydroelectric power generation utilizes the energy of flowing water to produce electricity. It is a major contributor to Kenya's electricity generation, accounting for 30% of the total in 2021.",
        "images": [],
        "status": true
    },
    {
        "id": 34,
        "title": "Solar and Wind Power",
        "text": "Solar and wind power are renewable energy sources that contribute to electricity generation globally. While their share in Kenya's generation mix may vary, they play a growing role in sustainable energy production.",
        "images": [],
        "status": true
    },
    {
        "id": 35,
        "title": "Challenges in Electricity Generation",
        "text": "Challenges in electricity generation include balancing supply and demand, integrating renewable sources into the grid, and ensuring reliability and affordability of electricity for consumers.",
        "images": [],
        "status": true
    },
    {
        "id": 36,
        "title": "Future of Electricity Generation",
        "text": "The future of electricity generation involves a shift towards cleaner and renewable energy sources, advancements in energy storage technologies, and smart grid systems for efficient power distribution.",
        "images": [],
        "status": true
    },
    {
        "id": 37,
        "title": "Global Electricity Generation Trends",
        "text": "Globally, electricity generation trends are moving towards reducing carbon emissions, increasing renewable energy adoption, and exploring innovative technologies for sustainable power generation.",
        "images": [],
        "status": true
    },
    {
        "id": 38,
        "title": "Energy Mix and Grid Stability",
        "text": "Achieving a balanced energy mix and ensuring grid stability are key considerations in electricity generation planning, involving a combination of traditional and renewable sources to meet evolving energy needs.",
        "images": [],
        "status": true
    },
    {
        "id": 39,
        "title": "Final Energy Consumption Overview",
        "text": "Total final consumption (TFC) represents the energy consumed by end users such as individuals, businesses, and industries for various purposes, including heating, cooling, lighting, transportation, and manufacturing processes. It encompasses both energy use for direct purposes and non-energy uses of energy products.",
        "images": [],
        "status": true
    },
    {
        "id": 40,
        "title": "Largest Source of Energy in Final Consumption",
        "text": "Biofuels and waste constitute the largest source of energy in final consumption in Kenya, accounting for 63% of the total final consumption in 2021. This highlights the significant role of renewable and sustainable energy sources in meeting end-user energy needs.",
        "images": [],
        "status": true
    },
    {
        "id": 41,
        "title": "Comparison of Final Consumption and Primary Energy Supply",
        "text": "The breakdown of final energy consumption can differ significantly from that of the primary energy supply (TES) due to energy conversion losses, especially in electricity generation. Both final consumption and primary energy supply data are essential for a comprehensive understanding of the energy system and its efficiency.",
        "images": [],
        "status": true
    },
    {
        "id": 42,
        "title": "Energy Consumption by Sector Overview",
        "text": "Energy consumption by sector refers to the distribution of a country's energy demand across different sectors, including residential, industrial, transport, commercial, public services, agriculture, forestry, and non-specified sectors. This breakdown is influenced by factors such as the economy, geography, and historical energy usage patterns.",
        "images": [],
        "status": true
    },
    {
        "id": 43,
        "title": "Largest Sector in Final Consumption",
        "text": "The residential sector is the largest sector in final energy consumption in Kenya, accounting for 66% of the total final consumption in 2021. This sector includes energy usage for households, such as heating, cooling, lighting, and household appliances.",
        "images": [],
        "status": true
    },
    {
        "id": 44,
        "title": "Industrial Sector",
        "text": "The industrial sector encompasses energy consumption for manufacturing, production processes, and industrial activities. It plays a significant role in the economy but may vary in its energy intensity and sources.",
        "images": [],
        "status": true
    },
    {
        "id": 45,
        "title": "Transport Sector",
        "text": "The transport sector includes energy consumption for vehicles, transportation services, and related infrastructure. It is a key sector in terms of energy demand and emissions.",
        "images": [],
        "status": true
    },
    {
        "id": 46,
        "title": "Commercial and Public Services Sector",
        "text": "The commercial and public services sector covers energy consumption in commercial buildings, offices, institutions, and public services such as hospitals and schools. It includes heating, cooling, lighting, and operational energy use.",
        "images": [],
        "status": true
    },
    {
        "id": 47,
        "title": "Agriculture and Forestry Sector",
        "text": "The agriculture and forestry sector involves energy consumption for agricultural activities, forestry management, and related processes. It includes energy use in farming, irrigation, processing, and transportation.",
        "images": [],
        "status": true
    },
    {
        "id": 48,
        "title": "Non-Specified Sector",
        "text": "The non-specified sector refers to energy consumption that is not specifically categorized into known sectors. It may include miscellaneous or unclassified energy usage.",
        "images": [],
        "status": true
    },
    {
        "id": 49,
        "title": "Non-Energy Use Sector",
        "text": "The non-energy use sector covers energy consumption for non-energy purposes, such as using fossil fuels for chemical production, raw material extraction, or other non-energy applications.",
        "images": [],
        "status": true
    },
    {
        "id": 50,
        "title": "Sectoral Energy Intensity",
        "text": "Different sectors have varying energy intensities, with some sectors requiring more energy per unit of output or activity. Understanding sectoral energy intensity is crucial for energy planning and efficiency measures.",
        "images": [],
        "status": true
    },
    {
        "id": 51,
        "title": "Energy Efficiency Measures",
        "text": "Implementing energy efficiency measures across sectors is essential for reducing overall energy consumption, lowering costs, and mitigating environmental impacts. It involves adopting technologies and practices to use energy more efficiently.",
        "images": [],
        "status": true
    }
]